// Написать программу, которая запросит пользователя ввести
// <Имя> в консоли.
// Получит введенную строку и выведет в консоль сообщение
// “Привет, <Имя>!”

package Sem_1;

public class t1_sem1 {
    public static void main(String[] args) throws Exception {
        System.out.println("dhgdlkgh");

        System.out.println("sdfsfsfsdfs");



    }
    
    
}
